РасчетныеЗадачиЗанятие4/src/Documents/БольничныйЛист/БольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БольничныйЛист</name>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>EnumRef.ПроцентыВыплатыБольничного</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.КоличествоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие4/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.ЗначениеДни</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>DefinedType.КоличествоВремени</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>DefinedType.ПоложительноеЧисло</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

РасчетныеЗадачиЗанятие4/src/Enums/СпособыРасчета/СпособыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчета</name>
  <enumValues>
    <name>ФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>НулеваяСумма</name>
  </enumValues>
  <enumValues>
    <name>ПоФормуле</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаДень</name>
  </enumValues>
</mdclass:Enum>

РасчетныеЗадачиЗанятие4/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>ДоплатаЗаВредность</name>
      <description>Доплата за вредность</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>СевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСбораБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетДанныеГрафика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

РасчетныеЗадачиЗанятие4/src/Documents/БольничныйЛист/ObjectModule.bsl
#Область РассчитатьРесурсыПоКоманде

Процедура РассчитатьРесурсы() Экспорт

	НачатьТранзакцию();

	ЗаполнитьНаборЗаписей_ОсновныеНачисления("Расчет");

	Движения.Записать();

	РассчитатьРесурсы_ОсновныеНачисления();

	ПерезаполнитьТабличнуюЧасть_ОсновныеНачисления();

	ОчиститьНаборыЗаписейПослеРасчета();

	ЗафиксироватьТранзакцию();

КонецПроцедуры

Процедура ПерезаполнитьТабличнуюЧасть_ОсновныеНачисления()

	ОсновныеНачисления.Очистить();

	Для Каждого Движение Из Движения.ОсновныеНачисления Цикл

		НоваяСтрока = ОсновныеНачисления.Добавить();

		ЗаполнитьЗначенияСвойств(НоваяСтрока, Движение);

	КонецЦикла;

КонецПроцедуры

Процедура ОчиститьНаборыЗаписейПослеРасчета()

	Движения.ОсновныеНачисления.Очистить();
	;
	Движения.ОсновныеНачисления.Записать();

КонецПроцедуры


#КонецОбласти

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаполнитьНаборЗаписей_ОсновныеНачисления("Запись");
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьНаборЗаписей_ОсновныеНачисления(КакИспользуем)

	Если КакИспользуем = "Расчет" Тогда

		ОсновныеНачисления.Очистить();
		
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.Размер = ПолучитьПроцентВыплатыЧислом(ПроцентВыплаты);
		Движение.ГрафикРаботы = Справочники.ВидыГрафиковРаботы.КалендарныеДни;

		Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Больничный;

		Движение.ПериодДействияНачало = ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ДатаОкончания);

		Движение.ПериодРегистрации = ПериодРегистрации;

		ПервоеЧислоМесяцаЗаболел = НачалоМесяца(ДатаНачала);

		Движение.БазовыйПериодНачало = ДобавитьМесяц(ПервоеЧислоМесяцаЗаболел, -3);
		Движение.БазовыйПериодКонец = ПервоеЧислоМесяцаЗаболел - 1;

		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Подразделение = Подразделение;
		Движение.Должность = Должность;

		Движение.Результат = 0;
		Движение.ОтработаноДней = 0;


	ИначеЕсли КакИспользуем = "Запись" Тогда

		Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл

			Движение = Движения.ОсновныеНачисления.Добавить();

			Движение.Сторно = ТекСтрокаОсновныеНачисления.Сторно;
			Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
			Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
			Движение.ГрафикРаботы = ТекСтрокаОсновныеНачисления.ГрафикРаботы;

			Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ПериодДействияНачало;
			Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ПериодДействияКонец;

			Движение.ПериодРегистрации = ПериодРегистрации;

			Движение.БазовыйПериодНачало = ТекСтрокаОсновныеНачисления.БазовыйПериодНачало;
			Движение.БазовыйПериодКонец = ТекСтрокаОсновныеНачисления.БазовыйПериодКонец;

			Движение.ФизическоеЛицо = ТекСтрокаОсновныеНачисления.ФизическоеЛицо;
			Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
			Движение.Должность = ТекСтрокаОсновныеНачисления.Должность;

			Движение.Результат = ТекСтрокаОсновныеНачисления.Результат;
			Движение.ОтработаноДней = ТекСтрокаОсновныеНачисления.ОтработаноДней;

		КонецЦикла;

	КонецЕсли;
	
	Движения.ОсновныеНачисления.Записывать = Истина;

КонецПроцедуры

Функция ПолучитьПроцентВыплатыЧислом(ПроцентСсылка) Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ПроцентыВыплатыБольничного._100, 100);
	Соответствие.Вставить(Перечисления.ПроцентыВыплатыБольничного._60, 60);
	Соответствие.Вставить(Перечисления.ПроцентыВыплатыБольничного._80, 80);

	Возврат Соответствие.Получить(ПроцентСсылка);
	
КонецФункции // ПолучитьПроцентВыплатыЧислом()

#Область РасчетРесурсов

Процедура РассчитатьРесурсы_ОсновныеНачисления()

	НаборЗаписей = Движения.ОсновныеНачисления;

	Менеджер = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ОсновныеНачисления.Регистратор КАК Регистратор,
	|	ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|	ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ОсновныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ОсновныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ОсновныеНачисления.Активность КАК Активность,
	|	ОсновныеНачисления.Сторно КАК Сторно,
	|	ОсновныеНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОсновныеНачисления.Подразделение КАК Подразделение,
	|	ОсновныеНачисления.Должность КАК Должность,
	|	ОсновныеНачисления.Результат КАК Результат,
	|	ОсновныеНачисления.ОтработаноДней КАК ОтработаноДней,
	|	ОсновныеНачисления.Размер КАК Размер,
	|	ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|ГДЕ
	|	ОсновныеНачисления.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДвижения.ВидРасчета
	|ПОМЕСТИТЬ ВТВидыРасчетаДокумента
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВидыРасчетаДокумента.ВидРасчета,
	|	ОсновныеНачисленияВедущиеВидыРасчета.ВидРасчета КАК ВедущийВидРасчета
	|ПОМЕСТИТЬ ВТВедущиеВидыРасчета
	|ИЗ
	|	ВТВидыРасчетаДокумента КАК ВТВидыРасчетаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисления.ВедущиеВидыРасчета КАК ОсновныеНачисленияВедущиеВидыРасчета
	|		ПО ВТВидыРасчетаДокумента.ВидРасчета = ОсновныеНачисленияВедущиеВидыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВедущиеВидыРасчета.ВидРасчета,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТВидыРасчетаДокумента.ВидРасчета) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыВидовРасчета
	|ИЗ
	|	ВТВедущиеВидыРасчета КАК ВТВедущиеВидыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРасчетаДокумента КАК ВТВидыРасчетаДокумента
	|		ПО ВТВедущиеВидыРасчета.ВедущийВидРасчета = ВТВидыРасчетаДокумента.ВидРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВедущиеВидыРасчета.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвижения.НомерСтроки КАК НомерСтроки,
	|	ВТДвижения.ВидРасчета КАК ВидРасчета,
	|	ВТДвижения.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТДвижения.Регистратор КАК Регистратор,
	|	ВТДвижения.ПериодДействия КАК ПериодДействия,
	|	ВТДвижения.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ВТДвижения.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВТДвижения.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ВТДвижения.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ВТДвижения.Активность КАК Активность,
	|	ВТДвижения.Сторно КАК Сторно,
	|	ВТДвижения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДвижения.Подразделение КАК Подразделение,
	|	ВТДвижения.Должность КАК Должность,
	|	ВТДвижения.Результат КАК Результат,
	|	ВТДвижения.ОтработаноДней КАК ОтработаноДней,
	|	ВТДвижения.Размер КАК Размер,
	|	ВТДвижения.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТПриоритетыВидовРасчета.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТДвиженияСПриоритетом
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетыВидовРасчета КАК ВТПриоритетыВидовРасчета
	|		ПО ВТДвижения.ВидРасчета = ВТПриоритетыВидовРасчета.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвиженияСПриоритетом.НомерСтроки КАК НомерСтроки,
	|	ВТДвиженияСПриоритетом.Приоритет КАК Приоритет,
	|	ВТДвиженияСПриоритетом.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ВТДвиженияСПриоритетом.ВидРасчета.Формула КАК Формула,
	|	ВТДвиженияСПриоритетом.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени
	|ИЗ
	|	ВТДвиженияСПриоритетом КАК ВТДвиженияСПриоритетом
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыРасчетаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВедущиеВидыРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПриоритетыВидовРасчета";

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаПриоритет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Внешний цикл по Приоритету
	Пока ВыборкаПриоритет.Следующий() Цикл
		
		//Вложенный цикл по записям текущей категории
		ВыборкаДетальныеЗаписи = ВыборкаПриоритет.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			Запись = НаборЗаписей.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);

			Если ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчета.ПоСреднемуЗаработку Тогда
				
				ОтработалЗаТриМесяца = 60;

				ДнейБолел = 7;

				Если ОтработалЗаТриМесяца = 0 Тогда
				
				//У нас социальное государство. Ст. 7 Конституции РФ.
				//Вы не работали до заболевания и нет базы для расчета среднего заработка.
				//Значит больничный платиться из расчтета по МРОТ (для примера взят МРОТ на 01.01.2023 г.)

					Запись.Результат = 16249 / 30 * ДнейБолел; 
				
				//Кстати. Ст. 29 Каждому гарантируется свобода мысли и слова.
				
				//Ст. 31. Граждане Российской Федерации имеют право собираться мирно,
				//без оружия, проводить собрания, митинги и демонстрации, шествия и пикетирование.

					Продолжить;
				КонецЕсли;

				ЗаработалЗаТриМесяца = 30000;

				ПроцентВыплатыБЛ = Запись.Размер;

				Запись.Результат = (ЗаработалЗаТриМесяца / ОтработалЗаТриМесяца) * ДнейБолел * ПроцентВыплатыБЛ / 100;
			КонецЕсли;

		КонецЦикла;
		
		НаборЗаписей.Записать( , Истина);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
